app/Controllers/Categories.php

SELECT *
FROM `categories`
---
    public function index() {
        $model = new CategoryModel();
        $data['categories'] = $model->findAll();

INSERT INTO `categories` (`name`, `description`) VALUES ('drinks', '')
---
    public function store() {
        $model = new CategoryModel();
        $model->save([
            'name'        => $this->request->getPost('name'),
            'description' => $this->request->getPost('description')
        ]);