app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `products`
SELECT *
FROM `products`
WHERE `stock` <= min_stock
SELECT SUM(`total_amount`) AS `total_amount`
FROM `sales`
WHERE DATE(created_at) = '2026-05-08'
 LIMIT 1
SELECT SUM(`remaining_debt`) AS `remaining_debt`
FROM `utangs`
WHERE `status` != 'paid'
 LIMIT 1
---
    public function index() {
        $productModel = new ProductModel();
        $saleModel = new SaleModel();
        $utangModel = new UtangModel();

        $data['total_products'] = $productModel->countAll();
        $data['low_stock']      = $productModel->where('stock <= min_stock')->findAll();
        $data['today_sales']    = $saleModel->selectSum('total_amount')->where('DATE(created_at)', date('Y-m-d'))->first()['total_amount'] ?? 0.00;
        $data['total_utang']    = $utangModel->selectSum('remaining_debt')->where('status !=', 'paid')->first()['remaining_debt'] ?? 0.00;