app/Controllers/Products.php

SELECT *
FROM `categories`
---
    public function create() {
        $catModel = new CategoryModel();
        $data['categories'] = $catModel->findAll();