app/Controllers/Reports.php

SELECT SUM(`total_amount`) AS `total_amount`
FROM `sales`
 LIMIT 1
---
    public function sales_report() {
        $model = new SaleModel();
        $data['sales'] = $model->getSalesHistory();
        $data['total_sum'] = $model->selectSum('total_amount')->first()['total_amount'] ?? 0.00;

SELECT SUM(`remaining_debt`) AS `remaining_debt`
FROM `utangs`
WHERE `status` != 'paid'
 LIMIT 1
---
    public function utang_report() {
        $model = new UtangModel();
        $data['ledgers'] = $model->getUtangLedger();
        $data['outstanding_debt'] = $model->selectSum('remaining_debt')->where('status !=', 'paid')->first()['remaining_debt'] ?? 0.00;