app/Controllers/Sales.php

SELECT *
FROM `products`
WHERE `stock` > 0
---
    public function create() {
        $prodModel = new ProductModel();
        $custModel = new CustomerModel();

        $data['products']  = json_encode($prodModel->where('stock >', 0)->findAll());