app/Models/CustomerModel.php

SELECT `customers`.*, COALESCE(SUM(utangs.remaining_debt), 0) as total_utang
FROM `customers`
LEFT JOIN `utangs` ON `utangs`.`customer_id` = `customers`.`id` AND `utangs`.`status` != "paid"
GROUP BY `customers`.`id`
---
    public function getCustomersWithDebt() {
        return $this->select('customers.*, COALESCE(SUM(utangs.remaining_debt), 0) as total_utang')
                    ->join('utangs', 'utangs.customer_id = customers.id AND utangs.status != "paid"', 'left')
                    ->groupBy('customers.id')
                    ->findAll();