app/Models/InventoryModel.php

SELECT `inventory_logs`.`id`, `inventory_logs`.`created_at`, `inventory_logs`.`change_qty`, `inventory_logs`.`type`, `inventory_logs`.`remarks`, `products`.`name` as `product_name`
FROM `inventory_logs`
LEFT JOIN `products` ON `products`.`id` = `inventory_logs`.`product_id`
ORDER BY `inventory_logs`.`created_at` DESC
---
    public function getLogs() {
    // ✅ CORRECT
    return $this->select('inventory_logs.id, inventory_logs.created_at, inventory_logs.change_qty, inventory_logs.type, inventory_logs.remarks, products.name as product_name')
                ->join('products', 'products.id = inventory_logs.product_id', 'left')
                ->orderBy('inventory_logs.created_at', 'DESC')
                ->findAll();