app/Models/ProductModel.php

SELECT `products`.`id`, `products`.`name`, `products`.`category_id`, `products`.`cost_price`, `products`.`retail_price`, `products`.`stock`, `products`.`min_stock`, `products`.`description`, `categories`.`name` as `category_name`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
---
    public function getProductsWithCategory() {
        return $this->select('products.id, products.name, products.category_id, products.cost_price, products.retail_price, products.stock, products.min_stock, products.description, categories.name as category_name')
                    ->join('categories', 'categories.id = products.category_id', 'left')
                    ->findAll();