app/Models/SaleModel.php

    public function getSalesHistory() {

    // ✅ CORRECT
    return $this->select('sales.id, sales.invoice_no, sales.created_at, sales.total_amount, sales.amount_paid, sales.payment_type, customers.name as customer_name')
                ->join('customers', 'customers.id = sales.customer_id', 'left')
                ->orderBy('sales.created_at', 'DESC')
                ->findAll();
---
SELECT `sales`.`id`, `sales`.`invoice_no`, `sales`.`created_at`, `sales`.`total_amount`, `sales`.`amount_paid`, `sales`.`payment_type`, `customers`.`name` as `customer_name`
FROM `sales`
LEFT JOIN `customers` ON `customers`.`id` = `sales`.`customer_id`
ORDER BY `sales`.`created_at` DESC