app/Models/UtangModel.php

    public function getUtangLedger() {
    // ✅ CORRECT
    return $this->select('utangs.id, utangs.total_debt, utangs.remaining_debt, utangs.status, utangs.due_date, customers.name as customer_name, sales.invoice_no')
                ->join('customers', 'customers.id = utangs.customer_id')
                ->join('sales', 'sales.id = utangs.sale_id')
                ->orderBy('utangs.status', 'ASC')
                ->findAll();
---
SELECT `utangs`.`id`, `utangs`.`total_debt`, `utangs`.`remaining_debt`, `utangs`.`status`, `utangs`.`due_date`, `customers`.`name` as `customer_name`, `sales`.`invoice_no`
FROM `utangs`
JOIN `customers` ON `customers`.`id` = `utangs`.`customer_id`
JOIN `sales` ON `sales`.`id` = `utangs`.`sale_id`
ORDER BY `utangs`.`status` ASC